Tutorials/validation/system/pcm/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    p_rgh
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-5;
        relTol           0.0001;
        maxIter           100;

    }

    T
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-5;
        relTol           0.0;
    }

    TFinal
    {
        $T;
        relTol           0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol           0;
        maxIter           100;
    }

    alpha.solid
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
    }

    "(U)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-5;
        relTol           0.001;
    }

    "(U)Final"
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nCorrectors          2;
    pRefCell        0;
    pRefValue       101537.990187;
}

relaxationFactors
{
    equations
    {
        h               1;
        U               1;
    }
}

// ************************************************************************* //
